; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-4-3-10)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	p0-1 - location
	p0-2 - location
	p0-3 - location
	p1-5 - location
	p4-0 - location
	p4-3 - location
	p5-0 - location
	p5-3 - location
	p5-4 - location
	)
	(:init
	(at driver1 s3)
	(at driver2 s2)
	(at driver3 s2)
	(at driver4 s4)
	(at truck1 s2)
	(empty truck1)
	(at truck2 s0)
	(empty truck2)
	(at truck3 s4)
	(empty truck3)
	(at package1 s2)
	(at package2 s0)
	(at package3 s0)
	(at package4 s2)
	(at package5 s5)
	(at package6 s2)
	(at package7 s2)
	(at package8 s2)
	(at package9 s1)
	(at package10 s4)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 26)
	(= (time-to-walk p0-1 s0) 26)
	(= (time-to-walk s1 p0-1) 86)
	(= (time-to-walk p0-1 s1) 86)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(= (time-to-walk s0 p0-2) 75)
	(= (time-to-walk p0-2 s0) 75)
	(= (time-to-walk s2 p0-2) 95)
	(= (time-to-walk p0-2 s2) 95)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(= (time-to-walk s0 p0-3) 87)
	(= (time-to-walk p0-3 s0) 87)
	(= (time-to-walk s3 p0-3) 85)
	(= (time-to-walk p0-3 s3) 85)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(= (time-to-walk s1 p1-5) 98)
	(= (time-to-walk p1-5 s1) 98)
	(= (time-to-walk s5 p1-5) 100)
	(= (time-to-walk p1-5 s5) 100)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(= (time-to-walk s4 p4-0) 85)
	(= (time-to-walk p4-0 s4) 85)
	(= (time-to-walk s0 p4-0) 80)
	(= (time-to-walk p4-0 s0) 80)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(= (time-to-walk s4 p4-3) 40)
	(= (time-to-walk p4-3 s4) 40)
	(= (time-to-walk s3 p4-3) 50)
	(= (time-to-walk p4-3 s3) 50)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(= (time-to-walk s5 p5-0) 83)
	(= (time-to-walk p5-0 s5) 83)
	(= (time-to-walk s0 p5-0) 39)
	(= (time-to-walk p5-0 s0) 39)
	(path s5 p5-3)
	(path p5-3 s5)
	(path s3 p5-3)
	(path p5-3 s3)
	(= (time-to-walk s5 p5-3) 55)
	(= (time-to-walk p5-3 s5) 55)
	(= (time-to-walk s3 p5-3) 9)
	(= (time-to-walk p5-3 s3) 9)
	(path s5 p5-4)
	(path p5-4 s5)
	(path s4 p5-4)
	(path p5-4 s4)
	(= (time-to-walk s5 p5-4) 88)
	(= (time-to-walk p5-4 s5) 88)
	(= (time-to-walk s4 p5-4) 100)
	(= (time-to-walk p5-4 s4) 100)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 73)
	(= (time-to-drive s2 s0) 73)
	(link s0 s5)
	(link s5 s0)
	(= (time-to-drive s0 s5) 22)
	(= (time-to-drive s5 s0) 22)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 27)
	(= (time-to-drive s0 s1) 27)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 1)
	(= (time-to-drive s3 s1) 1)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 72)
	(= (time-to-drive s4 s1) 72)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 1)
	(= (time-to-drive s1 s2) 1)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 13)
	(= (time-to-drive s4 s2) 13)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 94)
	(= (time-to-drive s0 s3) 94)
	(link s3 s5)
	(link s5 s3)
	(= (time-to-drive s3 s5) 75)
	(= (time-to-drive s5 s3) 75)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 17)
	(= (time-to-drive s0 s4) 17)
	(link s5 s2)
	(link s2 s5)
	(= (time-to-drive s5 s2) 77)
	(= (time-to-drive s2 s5) 77)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s1)
	(at driver2 s1)
	(at driver3 s2)
	(at truck1 s5)
	(at truck2 s5)
	(at truck3 s3)
	(at package1 s0)
	(at package3 s0)
	(at package5 s0)
	(at package6 s2)
	(at package7 s1)
	(at package8 s4)
	(at package10 s2)
	))

(:metric minimize (+ (+ (* 1  (total-time)) (* 4  (driven))) (* 1  (walked))))

)

; plan
1. (board-truck driver2 truck1 s2)
   deleted: (at driver2 s2) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 3 of 13
2. (walk driver1 s3 p0-3)
   deleted: (at driver1 s3)
   added: (at driver1 p0-3)
   changed: (walked) from 0 to 85
   goals met: 3 of 13
3. (load-truck package1 truck1 s2)
   deleted: (at package1 s2)
   added: (in package1 truck1)
   goals met: 3 of 13
4. (load-truck package7 truck1 s2)
   deleted: (at package7 s2)
   added: (in package7 truck1)
   goals met: 3 of 13
5. (load-truck package8 truck1 s2)
   deleted: (at package8 s2)
   added: (in package8 truck1)
   goals met: 3 of 13
6. (walk driver1 p0-3 s0)
   deleted: (at driver1 p0-3)
   added: (at driver1 s0)
   changed: (walked) from 85 to 172
   goals met: 3 of 13
7. (drive-truck truck1 s2 s5 driver2)
   deleted: (at truck1 s2)
   added: (at truck1 s5)
   changed: (driven) from 0 to 77
   goals met: 4 of 13
8. (board-truck driver1 truck2 s0)
   deleted: (at driver1 s0) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 4 of 13
9. (load-truck package5 truck1 s5)
   deleted: (at package5 s5)
   added: (in package5 truck1)
   goals met: 4 of 13
10. (drive-truck truck1 s5 s0 driver2)
   deleted: (at truck1 s5)
   added: (at truck1 s0)
   changed: (driven) from 77 to 99
   goals met: 3 of 13
11. (unload-truck package1 truck1 s0)
   deleted: (in package1 truck1)
   added: (at package1 s0)
   goals met: 4 of 13
12. (unload-truck package5 truck1 s0)
   deleted: (in package5 truck1)
   added: (at package5 s0)
   goals met: 5 of 13
13. (board-truck driver4 truck3 s4)
   deleted: (at driver4 s4) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 5 of 13
14. (drive-truck truck1 s0 s4 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s4)
   changed: (driven) from 99 to 116
   goals met: 5 of 13
15. (unload-truck package8 truck1 s4)
   deleted: (in package8 truck1)
   added: (at package8 s4)
   goals met: 6 of 13
16. (drive-truck truck3 s4 s1 driver4)
   deleted: (at truck3 s4)
   added: (at truck3 s1)
   changed: (driven) from 116 to 188
   goals met: 6 of 13
17. (drive-truck truck3 s1 s3 driver4)
   deleted: (at truck3 s1)
   added: (at truck3 s3)
   changed: (driven) from 188 to 189
   goals met: 7 of 13
18. (drive-truck truck2 s0 s5 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s5)
   changed: (driven) from 189 to 211
   goals met: 8 of 13
19. (disembark-truck driver1 truck2 s5)
   deleted: (driving driver1 truck2)
   added: (at driver1 s5) (empty truck2)
   goals met: 8 of 13
20. (walk driver1 s5 p1-5)
   deleted: (at driver1 s5)
   added: (at driver1 p1-5)
   changed: (walked) from 172 to 272
   goals met: 8 of 13
21. (walk driver1 p1-5 s1)
   deleted: (at driver1 p1-5)
   added: (at driver1 s1)
   changed: (walked) from 272 to 370
   goals met: 9 of 13
22. (load-truck package10 truck1 s4)
   deleted: (at package10 s4)
   added: (in package10 truck1)
   goals met: 9 of 13
23. (drive-truck truck1 s4 s2 driver2)
   deleted: (at truck1 s4)
   added: (at truck1 s2)
   changed: (driven) from 211 to 224
   goals met: 9 of 13
24. (unload-truck package10 truck1 s2)
   deleted: (in package10 truck1)
   added: (at package10 s2)
   goals met: 10 of 13
25. (drive-truck truck1 s2 s1 driver2)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   changed: (driven) from 224 to 225
   goals met: 10 of 13
26. (unload-truck package7 truck1 s1)
   deleted: (in package7 truck1)
   added: (at package7 s1)
   goals met: 11 of 13
27. (drive-truck truck1 s1 s0 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   changed: (driven) from 225 to 252
   goals met: 11 of 13
28. (drive-truck truck1 s0 s5 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s5)
   changed: (driven) from 252 to 274
   goals met: 12 of 13
29. (disembark-truck driver2 truck1 s5)
   deleted: (driving driver2 truck1)
   added: (at driver2 s5) (empty truck1)
   goals met: 12 of 13
30. (walk driver2 s5 p1-5)
   deleted: (at driver2 s5)
   added: (at driver2 p1-5)
   changed: (walked) from 370 to 470
   goals met: 12 of 13
31. (walk driver2 p1-5 s1)
   deleted: (at driver2 p1-5)
   added: (at driver2 s1)
   changed: (walked) from 470 to 568
   goals met: 13 of 13
